In [86]:
#import packages
import json
import matplotlib.pyplot as plt
import pandas as pd

In [200]:
df_2010 = pd.read_csv('assets/yob_2010.csv')
df_2019 = pd.read_csv('assets/yob2019.csv')


years_dataframes = [df_2010, df_2019]
df_combined_years = pd.concat(years_dataframes, ignore_index=True)
df_combined_years





#I know there are Emmas(and other duplicate names) in 2010 and 2019, so how do combine all mentions of Emma (and other names) as one result in the name column?

           Name Gender  2010 Name Count  2019 Name Count
0      Isabella      F          22925.0              NaN
1        Sophia      F          20648.0              NaN
2          Emma      F          17354.0              NaN
3        Olivia      F          17030.0              NaN
4           Ava      F          15436.0              NaN
...         ...    ...              ...              ...
66156    Zyheem      M              NaN              5.0
66157     Zykel      M              NaN              5.0
66158    Zyking      M              NaN              5.0
66159       Zyn      M              NaN              5.0
66160     Zyran      M              NaN              5.0

[66161 rows x 4 columns]

In [132]:
df.dtypes

Name                object
Gender              object
2010 Name Count    float64
2019 Name Count    float64
dtype: object

In [174]:
#convert "Name Count" columns to integers; changing NaN results to zeroes

In [201]:
# find the name Cersei in the name column
df[df['Name'].str.contains('Cersei')]

         Name Gender  2010 Name Count  2019 Name Count
14128  Cersei      F              NaN              6.0